Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI24 */
#define IFX_PSI5_CRCICLR_CRCI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI24 */
#define IFX_PSI5_CRCICLR_CRCI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI0 */
#define IFX_PSI5_CRCIOV_CRCI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI0 */
#define IFX_PSI5_CRCIOV_CRCI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI0 */
#define IFX_PSI5_CRCIOV_CRCI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI14 */
#define IFX_PSI5_CRCIOV_CRCI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI14 */
#define IFX_PSI5_CRCIOV_CRCI14_MSK (0x1u)

