Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI7 */
#define IFX_PSI5_CRCIOV_CRCI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI7 */
#define IFX_PSI5_CRCIOV_CRCI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI7 */
#define IFX_PSI5_CRCIOV_CRCI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI8 */
#define IFX_PSI5_CRCIOV_CRCI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI8 */
#define IFX_PSI5_CRCIOV_CRCI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI8 */
#define IFX_PSI5_CRCIOV_CRCI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI9 */
#define IFX_PSI5_CRCIOV_CRCI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI9 */
#define IFX_PSI5_CRCIOV_CRCI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI9 */
#define IFX_PSI5_CRCIOV_CRCI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI0 */
#define IFX_PSI5_CRCISET_CRCI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI0 */
#define IFX_PSI5_CRCISET_CRCI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI0 */
#define IFX_PSI5_CRCISET_CRCI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI10 */
#define IFX_PSI5_CRCISET_CRCI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI10 */
#define IFX_PSI5_CRCISET_CRCI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI10 */
#define IFX_PSI5_CRCISET_CRCI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI11 */
#define IFX_PSI5_CRCISET_CRCI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI11 */
#define IFX_PSI5_CRCISET_CRCI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI11 */
#define IFX_PSI5_CRCISET_CRCI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI12 */
#define IFX_PSI5_CRCISET_CRCI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI12 */
#define IFX_PSI5_CRCISET_CRCI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI12 */
#define IFX_PSI5_CRCISET_CRCI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI13 */
#define IFX_PSI5_CRCISET_CRCI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI13 */
#define IFX_PSI5_CRCISET_CRCI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI13 */
#define IFX_PSI5_CRCISET_CRCI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI14 */
#define IFX_PSI5_CRCISET_CRCI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI14 */
#define IFX_PSI5_CRCISET_CRCI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI14 */
#define IFX_PSI5_CRCISET_CRCI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI15 */
#define IFX_PSI5_CRCISET_CRCI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI15 */
#define IFX_PSI5_CRCISET_CRCI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI15 */
#define IFX_PSI5_CRCISET_CRCI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI16 */
#define IFX_PSI5_CRCISET_CRCI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI16 */
#define IFX_PSI5_CRCISET_CRCI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI16 */
#define IFX_PSI5_CRCISET_CRCI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI17 */
#define IFX_PSI5_CRCISET_CRCI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI17 */
#define IFX_PSI5_CRCISET_CRCI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI17 */
#define IFX_PSI5_CRCISET_CRCI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI18 */
#define IFX_PSI5_CRCISET_CRCI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI18 */
#define IFX_PSI5_CRCISET_CRCI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI18 */
#define IFX_PSI5_CRCISET_CRCI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI19 */
#define IFX_PSI5_CRCISET_CRCI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI19 */
#define IFX_PSI5_CRCISET_CRCI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI19 */
#define IFX_PSI5_CRCISET_CRCI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI1 */
#define IFX_PSI5_CRCISET_CRCI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI1 */
#define IFX_PSI5_CRCISET_CRCI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI1 */
#define IFX_PSI5_CRCISET_CRCI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI20 */
#define IFX_PSI5_CRCISET_CRCI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI20 */
#define IFX_PSI5_CRCISET_CRCI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI20 */
#define IFX_PSI5_CRCISET_CRCI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI21 */
#define IFX_PSI5_CRCISET_CRCI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI21 */
#define IFX_PSI5_CRCISET_CRCI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI21 */
#define IFX_PSI5_CRCISET_CRCI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI22 */
#define IFX_PSI5_CRCISET_CRCI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI22 */
#define IFX_PSI5_CRCISET_CRCI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI22 */
#define IFX_PSI5_CRCISET_CRCI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI23 */
#define IFX_PSI5_CRCISET_CRCI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI23 */
#define IFX_PSI5_CRCISET_CRCI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI23 */
#define IFX_PSI5_CRCISET_CRCI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI24 */
#define IFX_PSI5_CRCISET_CRCI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI24 */
#define IFX_PSI5_CRCISET_CRCI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI24 */
#define IFX_PSI5_CRCISET_CRCI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI25 */
#define IFX_PSI5_CRCISET_CRCI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI25 */
#define IFX_PSI5_CRCISET_CRCI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI25 */
#define IFX_PSI5_CRCISET_CRCI25_OFF (25u)

