Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SCRI1 */
#define IFX_PSI5_INTCLRB_SCRI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SCRI1 */
#define IFX_PSI5_INTCLRB_SCRI1_OFF (19u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SCRI2 */
#define IFX_PSI5_INTCLRB_SCRI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SCRI2 */
#define IFX_PSI5_INTCLRB_SCRI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SCRI2 */
#define IFX_PSI5_INTCLRB_SCRI2_OFF (20u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SCRI3 */
#define IFX_PSI5_INTCLRB_SCRI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SCRI3 */
#define IFX_PSI5_INTCLRB_SCRI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SCRI3 */
#define IFX_PSI5_INTCLRB_SCRI3_OFF (21u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SCRI4 */
#define IFX_PSI5_INTCLRB_SCRI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SCRI4 */
#define IFX_PSI5_INTCLRB_SCRI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SCRI4 */
#define IFX_PSI5_INTCLRB_SCRI4_OFF (22u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SCRI5 */
#define IFX_PSI5_INTCLRB_SCRI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SCRI5 */
#define IFX_PSI5_INTCLRB_SCRI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SCRI5 */
#define IFX_PSI5_INTCLRB_SCRI5_OFF (23u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SDI0 */
#define IFX_PSI5_INTCLRB_SDI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SDI0 */
#define IFX_PSI5_INTCLRB_SDI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SDI0 */
#define IFX_PSI5_INTCLRB_SDI0_OFF (6u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SDI1 */
#define IFX_PSI5_INTCLRB_SDI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SDI1 */
#define IFX_PSI5_INTCLRB_SDI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SDI1 */
#define IFX_PSI5_INTCLRB_SDI1_OFF (7u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SDI2 */
#define IFX_PSI5_INTCLRB_SDI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SDI2 */
#define IFX_PSI5_INTCLRB_SDI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SDI2 */
#define IFX_PSI5_INTCLRB_SDI2_OFF (8u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SDI3 */
#define IFX_PSI5_INTCLRB_SDI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SDI3 */
#define IFX_PSI5_INTCLRB_SDI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SDI3 */
#define IFX_PSI5_INTCLRB_SDI3_OFF (9u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SDI4 */
#define IFX_PSI5_INTCLRB_SDI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SDI4 */
#define IFX_PSI5_INTCLRB_SDI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SDI4 */
#define IFX_PSI5_INTCLRB_SDI4_OFF (10u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SDI5 */
#define IFX_PSI5_INTCLRB_SDI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SDI5 */
#define IFX_PSI5_INTCLRB_SDI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SDI5 */
#define IFX_PSI5_INTCLRB_SDI5_OFF (11u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SOI0 */
#define IFX_PSI5_INTCLRB_SOI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SOI0 */
#define IFX_PSI5_INTCLRB_SOI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SOI0 */
#define IFX_PSI5_INTCLRB_SOI0_OFF (12u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SOI1 */
#define IFX_PSI5_INTCLRB_SOI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SOI1 */
#define IFX_PSI5_INTCLRB_SOI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SOI1 */
#define IFX_PSI5_INTCLRB_SOI1_OFF (13u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SOI2 */
#define IFX_PSI5_INTCLRB_SOI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SOI2 */
#define IFX_PSI5_INTCLRB_SOI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SOI2 */
#define IFX_PSI5_INTCLRB_SOI2_OFF (14u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SOI3 */
#define IFX_PSI5_INTCLRB_SOI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SOI3 */
#define IFX_PSI5_INTCLRB_SOI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SOI3 */
#define IFX_PSI5_INTCLRB_SOI3_OFF (15u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SOI4 */
#define IFX_PSI5_INTCLRB_SOI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SOI4 */
#define IFX_PSI5_INTCLRB_SOI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SOI4 */
#define IFX_PSI5_INTCLRB_SOI4_OFF (16u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SOI5 */
#define IFX_PSI5_INTCLRB_SOI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SOI5 */
#define IFX_PSI5_INTCLRB_SOI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SOI5 */
#define IFX_PSI5_INTCLRB_SOI5_OFF (17u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI0 */
#define IFX_PSI5_INTCLRB_WSI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI0 */
#define IFX_PSI5_INTCLRB_WSI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI0 */
#define IFX_PSI5_INTCLRB_WSI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI1 */
#define IFX_PSI5_INTCLRB_WSI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI1 */
#define IFX_PSI5_INTCLRB_WSI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI1 */
#define IFX_PSI5_INTCLRB_WSI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI2 */
#define IFX_PSI5_INTCLRB_WSI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI3 */
#define IFX_PSI5_INTCLRB_WSI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI4 */
#define IFX_PSI5_INTCLRB_WSI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI4 */
#define IFX_PSI5_INTCLRB_WSI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI4 */
#define IFX_PSI5_INTCLRB_WSI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.WSI5 */
#define IFX_PSI5_INTCLRB_WSI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.WSI5 */
#define IFX_PSI5_INTCLRB_WSI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.WSI5 */
#define IFX_PSI5_INTCLRB_WSI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.CRCI */
#define IFX_PSI5_INTENA_CRCI_OFF (6u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.FWI */
#define IFX_PSI5_INTENA_FWI_OFF (7u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_MSK (0x1u)

