Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_INTENA_Bits.MEI */
#define IFX_PSI5_INTENA_MEI_OFF (5u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.NBI */
#define IFX_PSI5_INTENA_NBI_OFF (4u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.NFI */
#define IFX_PSI5_INTENA_NFI_OFF (16u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.RBI */
#define IFX_PSI5_INTENA_RBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.RBI */
#define IFX_PSI5_INTENA_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.RBI */
#define IFX_PSI5_INTENA_RBI_OFF (2u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.RDI */
#define IFX_PSI5_INTENA_RDI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.RDI */
#define IFX_PSI5_INTENA_RDI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.RDI */
#define IFX_PSI5_INTENA_RDI_OFF (1u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.RMI */
#define IFX_PSI5_INTENA_RMI_OFF (9u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.RSI */
#define IFX_PSI5_INTENA_RSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.RSI */
#define IFX_PSI5_INTENA_RSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.RSI */
#define IFX_PSI5_INTENA_RSI_OFF (0u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.RUI */
#define IFX_PSI5_INTENA_RUI_OFF (8u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.TEI */
#define IFX_PSI5_INTENA_TEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.TEI */
#define IFX_PSI5_INTENA_TEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.TEI */
#define IFX_PSI5_INTENA_TEI_OFF (3u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.TOI */
#define IFX_PSI5_INTENA_TOI_OFF (14u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.TOOI */
#define IFX_PSI5_INTENA_TOOI_OFF (15u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.TPI */
#define IFX_PSI5_INTENA_TPI_OFF (10u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.TPOI */
#define IFX_PSI5_INTENA_TPOI_OFF (11u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.TSI */
#define IFX_PSI5_INTENA_TSI_OFF (12u)

/** \brief  Length for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENA_Bits.TSOI */
#define IFX_PSI5_INTENA_TSOI_OFF (13u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_OFF (18u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SCRI1 */
#define IFX_PSI5_INTENB_SCRI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SCRI1 */
#define IFX_PSI5_INTENB_SCRI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SCRI1 */
#define IFX_PSI5_INTENB_SCRI1_OFF (19u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SCRI2 */
#define IFX_PSI5_INTENB_SCRI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SCRI2 */
#define IFX_PSI5_INTENB_SCRI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SCRI2 */
#define IFX_PSI5_INTENB_SCRI2_OFF (20u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SCRI3 */
#define IFX_PSI5_INTENB_SCRI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SCRI3 */
#define IFX_PSI5_INTENB_SCRI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SCRI3 */
#define IFX_PSI5_INTENB_SCRI3_OFF (21u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SCRI4 */
#define IFX_PSI5_INTENB_SCRI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SCRI4 */
#define IFX_PSI5_INTENB_SCRI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SCRI4 */
#define IFX_PSI5_INTENB_SCRI4_OFF (22u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SCRI5 */
#define IFX_PSI5_INTENB_SCRI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SCRI5 */
#define IFX_PSI5_INTENB_SCRI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SCRI5 */
#define IFX_PSI5_INTENB_SCRI5_OFF (23u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SDI0 */
#define IFX_PSI5_INTENB_SDI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SDI0 */
#define IFX_PSI5_INTENB_SDI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SDI0 */
#define IFX_PSI5_INTENB_SDI0_OFF (6u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SDI1 */
#define IFX_PSI5_INTENB_SDI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SDI1 */
#define IFX_PSI5_INTENB_SDI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SDI1 */
#define IFX_PSI5_INTENB_SDI1_OFF (7u)

