Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI17 */
#define IFX_PSI5_NBIOV_NBI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI18 */
#define IFX_PSI5_NBIOV_NBI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI18 */
#define IFX_PSI5_NBIOV_NBI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI18 */
#define IFX_PSI5_NBIOV_NBI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI19 */
#define IFX_PSI5_NBIOV_NBI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI19 */
#define IFX_PSI5_NBIOV_NBI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI19 */
#define IFX_PSI5_NBIOV_NBI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI1 */
#define IFX_PSI5_NBIOV_NBI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI1 */
#define IFX_PSI5_NBIOV_NBI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI1 */
#define IFX_PSI5_NBIOV_NBI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI20 */
#define IFX_PSI5_NBIOV_NBI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI20 */
#define IFX_PSI5_NBIOV_NBI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI20 */
#define IFX_PSI5_NBIOV_NBI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI21 */
#define IFX_PSI5_NBIOV_NBI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI21 */
#define IFX_PSI5_NBIOV_NBI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI21 */
#define IFX_PSI5_NBIOV_NBI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI22 */
#define IFX_PSI5_NBIOV_NBI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI22 */
#define IFX_PSI5_NBIOV_NBI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI22 */
#define IFX_PSI5_NBIOV_NBI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI23 */
#define IFX_PSI5_NBIOV_NBI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI23 */
#define IFX_PSI5_NBIOV_NBI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI23 */
#define IFX_PSI5_NBIOV_NBI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI24 */
#define IFX_PSI5_NBIOV_NBI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI24 */
#define IFX_PSI5_NBIOV_NBI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI24 */
#define IFX_PSI5_NBIOV_NBI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI25 */
#define IFX_PSI5_NBIOV_NBI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI25 */
#define IFX_PSI5_NBIOV_NBI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI25 */
#define IFX_PSI5_NBIOV_NBI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI26 */
#define IFX_PSI5_NBIOV_NBI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI26 */
#define IFX_PSI5_NBIOV_NBI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI26 */
#define IFX_PSI5_NBIOV_NBI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI27 */
#define IFX_PSI5_NBIOV_NBI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI27 */
#define IFX_PSI5_NBIOV_NBI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI27 */
#define IFX_PSI5_NBIOV_NBI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_OFF (8u)

