Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI19 */
#define IFX_PSI5_NFIOV_NFI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI19 */
#define IFX_PSI5_NFIOV_NFI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI19 */
#define IFX_PSI5_NFIOV_NFI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI1 */
#define IFX_PSI5_NFIOV_NFI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI1 */
#define IFX_PSI5_NFIOV_NFI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI1 */
#define IFX_PSI5_NFIOV_NFI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI20 */
#define IFX_PSI5_NFIOV_NFI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI20 */
#define IFX_PSI5_NFIOV_NFI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI20 */
#define IFX_PSI5_NFIOV_NFI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI21 */
#define IFX_PSI5_NFIOV_NFI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI21 */
#define IFX_PSI5_NFIOV_NFI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI21 */
#define IFX_PSI5_NFIOV_NFI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI22 */
#define IFX_PSI5_NFIOV_NFI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI22 */
#define IFX_PSI5_NFIOV_NFI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI22 */
#define IFX_PSI5_NFIOV_NFI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI23 */
#define IFX_PSI5_NFIOV_NFI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI23 */
#define IFX_PSI5_NFIOV_NFI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI23 */
#define IFX_PSI5_NFIOV_NFI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI24 */
#define IFX_PSI5_NFIOV_NFI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI24 */
#define IFX_PSI5_NFIOV_NFI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI24 */
#define IFX_PSI5_NFIOV_NFI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI25 */
#define IFX_PSI5_NFIOV_NFI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI25 */
#define IFX_PSI5_NFIOV_NFI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI25 */
#define IFX_PSI5_NFIOV_NFI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI26 */
#define IFX_PSI5_NFIOV_NFI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI26 */
#define IFX_PSI5_NFIOV_NFI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI26 */
#define IFX_PSI5_NFIOV_NFI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI27 */
#define IFX_PSI5_NFIOV_NFI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI27 */
#define IFX_PSI5_NFIOV_NFI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI27 */
#define IFX_PSI5_NFIOV_NFI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI28 */
#define IFX_PSI5_NFIOV_NFI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI28 */
#define IFX_PSI5_NFIOV_NFI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI28 */
#define IFX_PSI5_NFIOV_NFI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI29 */
#define IFX_PSI5_NFIOV_NFI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI29 */
#define IFX_PSI5_NFIOV_NFI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI29 */
#define IFX_PSI5_NFIOV_NFI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI2 */
#define IFX_PSI5_NFIOV_NFI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI2 */
#define IFX_PSI5_NFIOV_NFI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI2 */
#define IFX_PSI5_NFIOV_NFI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI30 */
#define IFX_PSI5_NFIOV_NFI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI30 */
#define IFX_PSI5_NFIOV_NFI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI30 */
#define IFX_PSI5_NFIOV_NFI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI3 */
#define IFX_PSI5_NFIOV_NFI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI3 */
#define IFX_PSI5_NFIOV_NFI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI3 */
#define IFX_PSI5_NFIOV_NFI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI4 */
#define IFX_PSI5_NFIOV_NFI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI4 */
#define IFX_PSI5_NFIOV_NFI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI4 */
#define IFX_PSI5_NFIOV_NFI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI5 */
#define IFX_PSI5_NFIOV_NFI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI5 */
#define IFX_PSI5_NFIOV_NFI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI5 */
#define IFX_PSI5_NFIOV_NFI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI6 */
#define IFX_PSI5_NFIOV_NFI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI6 */
#define IFX_PSI5_NFIOV_NFI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI6 */
#define IFX_PSI5_NFIOV_NFI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_NFIOV_Bits.NFI7 */
#define IFX_PSI5_NFIOV_NFI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI7 */
#define IFX_PSI5_NFIOV_NFI7_MSK (0x1u)

