Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI29 */
#define IFX_PSI5_NFISET_NFI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI29 */
#define IFX_PSI5_NFISET_NFI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI29 */
#define IFX_PSI5_NFISET_NFI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI2 */
#define IFX_PSI5_NFISET_NFI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI2 */
#define IFX_PSI5_NFISET_NFI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI2 */
#define IFX_PSI5_NFISET_NFI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_LEN (4u)

/** \brief  Mask for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_OFF (24u)

/** \brief  Length for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_LEN (32u)

/** \brief  Mask for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_MSK (0xffffffffu)

/** \brief  Offset for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_OFF (0u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI11 */
#define IFX_PSI5_RDICLR_RDI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI11 */
#define IFX_PSI5_RDICLR_RDI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI11 */
#define IFX_PSI5_RDICLR_RDI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI12 */
#define IFX_PSI5_RDICLR_RDI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI12 */
#define IFX_PSI5_RDICLR_RDI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI12 */
#define IFX_PSI5_RDICLR_RDI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI13 */
#define IFX_PSI5_RDICLR_RDI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI13 */
#define IFX_PSI5_RDICLR_RDI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI13 */
#define IFX_PSI5_RDICLR_RDI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI14 */
#define IFX_PSI5_RDICLR_RDI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI14 */
#define IFX_PSI5_RDICLR_RDI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI14 */
#define IFX_PSI5_RDICLR_RDI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI15 */
#define IFX_PSI5_RDICLR_RDI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI15 */
#define IFX_PSI5_RDICLR_RDI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI15 */
#define IFX_PSI5_RDICLR_RDI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI16 */
#define IFX_PSI5_RDICLR_RDI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI16 */
#define IFX_PSI5_RDICLR_RDI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI16 */
#define IFX_PSI5_RDICLR_RDI16_OFF (16u)

