Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI17 */
#define IFX_PSI5_RDICLR_RDI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI17 */
#define IFX_PSI5_RDICLR_RDI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI17 */
#define IFX_PSI5_RDICLR_RDI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI18 */
#define IFX_PSI5_RDICLR_RDI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI18 */
#define IFX_PSI5_RDICLR_RDI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI18 */
#define IFX_PSI5_RDICLR_RDI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI19 */
#define IFX_PSI5_RDICLR_RDI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI19 */
#define IFX_PSI5_RDICLR_RDI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI19 */
#define IFX_PSI5_RDICLR_RDI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI20 */
#define IFX_PSI5_RDICLR_RDI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI20 */
#define IFX_PSI5_RDICLR_RDI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI20 */
#define IFX_PSI5_RDICLR_RDI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI21 */
#define IFX_PSI5_RDICLR_RDI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI21 */
#define IFX_PSI5_RDICLR_RDI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI21 */
#define IFX_PSI5_RDICLR_RDI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI22 */
#define IFX_PSI5_RDICLR_RDI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI22 */
#define IFX_PSI5_RDICLR_RDI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI22 */
#define IFX_PSI5_RDICLR_RDI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI23 */
#define IFX_PSI5_RDICLR_RDI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI23 */
#define IFX_PSI5_RDICLR_RDI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI23 */
#define IFX_PSI5_RDICLR_RDI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI24 */
#define IFX_PSI5_RDICLR_RDI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI24 */
#define IFX_PSI5_RDICLR_RDI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI24 */
#define IFX_PSI5_RDICLR_RDI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI25 */
#define IFX_PSI5_RDICLR_RDI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI25 */
#define IFX_PSI5_RDICLR_RDI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI25 */
#define IFX_PSI5_RDICLR_RDI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI26 */
#define IFX_PSI5_RDICLR_RDI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI26 */
#define IFX_PSI5_RDICLR_RDI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI26 */
#define IFX_PSI5_RDICLR_RDI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI27 */
#define IFX_PSI5_RDICLR_RDI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI27 */
#define IFX_PSI5_RDICLR_RDI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI27 */
#define IFX_PSI5_RDICLR_RDI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI28 */
#define IFX_PSI5_RDICLR_RDI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI28 */
#define IFX_PSI5_RDICLR_RDI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI28 */
#define IFX_PSI5_RDICLR_RDI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI29 */
#define IFX_PSI5_RDICLR_RDI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI29 */
#define IFX_PSI5_RDICLR_RDI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI29 */
#define IFX_PSI5_RDICLR_RDI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI30 */
#define IFX_PSI5_RDICLR_RDI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI30 */
#define IFX_PSI5_RDICLR_RDI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI30 */
#define IFX_PSI5_RDICLR_RDI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI31 */
#define IFX_PSI5_RDICLR_RDI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI31 */
#define IFX_PSI5_RDICLR_RDI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI31 */
#define IFX_PSI5_RDICLR_RDI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_OFF (11u)

