Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI15 */
#define IFX_PSI5_RDIOV_RDI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI15 */
#define IFX_PSI5_RDIOV_RDI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI15 */
#define IFX_PSI5_RDIOV_RDI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI16 */
#define IFX_PSI5_RDIOV_RDI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI16 */
#define IFX_PSI5_RDIOV_RDI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI16 */
#define IFX_PSI5_RDIOV_RDI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI17 */
#define IFX_PSI5_RDIOV_RDI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI17 */
#define IFX_PSI5_RDIOV_RDI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI17 */
#define IFX_PSI5_RDIOV_RDI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI18 */
#define IFX_PSI5_RDIOV_RDI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI18 */
#define IFX_PSI5_RDIOV_RDI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI18 */
#define IFX_PSI5_RDIOV_RDI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI19 */
#define IFX_PSI5_RDIOV_RDI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI19 */
#define IFX_PSI5_RDIOV_RDI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI19 */
#define IFX_PSI5_RDIOV_RDI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI20 */
#define IFX_PSI5_RDIOV_RDI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI20 */
#define IFX_PSI5_RDIOV_RDI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI20 */
#define IFX_PSI5_RDIOV_RDI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI21 */
#define IFX_PSI5_RDIOV_RDI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI21 */
#define IFX_PSI5_RDIOV_RDI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI21 */
#define IFX_PSI5_RDIOV_RDI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI22 */
#define IFX_PSI5_RDIOV_RDI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI22 */
#define IFX_PSI5_RDIOV_RDI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI22 */
#define IFX_PSI5_RDIOV_RDI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI23 */
#define IFX_PSI5_RDIOV_RDI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI23 */
#define IFX_PSI5_RDIOV_RDI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI23 */
#define IFX_PSI5_RDIOV_RDI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI24 */
#define IFX_PSI5_RDIOV_RDI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI24 */
#define IFX_PSI5_RDIOV_RDI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI24 */
#define IFX_PSI5_RDIOV_RDI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI25 */
#define IFX_PSI5_RDIOV_RDI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI25 */
#define IFX_PSI5_RDIOV_RDI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI25 */
#define IFX_PSI5_RDIOV_RDI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI26 */
#define IFX_PSI5_RDIOV_RDI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI26 */
#define IFX_PSI5_RDIOV_RDI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI26 */
#define IFX_PSI5_RDIOV_RDI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI30 */
#define IFX_PSI5_RDIOV_RDI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI30 */
#define IFX_PSI5_RDIOV_RDI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI30 */
#define IFX_PSI5_RDIOV_RDI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI31 */
#define IFX_PSI5_RDIOV_RDI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI31 */
#define IFX_PSI5_RDIOV_RDI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI31 */
#define IFX_PSI5_RDIOV_RDI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_OFF (3u)

