Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI10 */
#define IFX_PSI5_RMISET_RMI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI10 */
#define IFX_PSI5_RMISET_RMI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI10 */
#define IFX_PSI5_RMISET_RMI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI11 */
#define IFX_PSI5_RMISET_RMI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI11 */
#define IFX_PSI5_RMISET_RMI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI11 */
#define IFX_PSI5_RMISET_RMI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI12 */
#define IFX_PSI5_RMISET_RMI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI12 */
#define IFX_PSI5_RMISET_RMI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI12 */
#define IFX_PSI5_RMISET_RMI12_OFF (12u)

