Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI13 */
#define IFX_PSI5_RMISET_RMI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI13 */
#define IFX_PSI5_RMISET_RMI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI13 */
#define IFX_PSI5_RMISET_RMI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI14 */
#define IFX_PSI5_RMISET_RMI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI14 */
#define IFX_PSI5_RMISET_RMI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI14 */
#define IFX_PSI5_RMISET_RMI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI15 */
#define IFX_PSI5_RMISET_RMI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI15 */
#define IFX_PSI5_RMISET_RMI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI15 */
#define IFX_PSI5_RMISET_RMI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI16 */
#define IFX_PSI5_RMISET_RMI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI16 */
#define IFX_PSI5_RMISET_RMI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI16 */
#define IFX_PSI5_RMISET_RMI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI17 */
#define IFX_PSI5_RMISET_RMI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI17 */
#define IFX_PSI5_RMISET_RMI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI17 */
#define IFX_PSI5_RMISET_RMI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI18 */
#define IFX_PSI5_RMISET_RMI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI18 */
#define IFX_PSI5_RMISET_RMI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI18 */
#define IFX_PSI5_RMISET_RMI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI19 */
#define IFX_PSI5_RMISET_RMI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI19 */
#define IFX_PSI5_RMISET_RMI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI19 */
#define IFX_PSI5_RMISET_RMI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI1 */
#define IFX_PSI5_RMISET_RMI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI20 */
#define IFX_PSI5_RMISET_RMI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI20 */
#define IFX_PSI5_RMISET_RMI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI20 */
#define IFX_PSI5_RMISET_RMI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI21 */
#define IFX_PSI5_RMISET_RMI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI21 */
#define IFX_PSI5_RMISET_RMI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI21 */
#define IFX_PSI5_RMISET_RMI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI22 */
#define IFX_PSI5_RMISET_RMI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI22 */
#define IFX_PSI5_RMISET_RMI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI22 */
#define IFX_PSI5_RMISET_RMI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI23 */
#define IFX_PSI5_RMISET_RMI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI23 */
#define IFX_PSI5_RMISET_RMI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI23 */
#define IFX_PSI5_RMISET_RMI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI24 */
#define IFX_PSI5_RMISET_RMI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI24 */
#define IFX_PSI5_RMISET_RMI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI24 */
#define IFX_PSI5_RMISET_RMI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI25 */
#define IFX_PSI5_RMISET_RMI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI25 */
#define IFX_PSI5_RMISET_RMI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI25 */
#define IFX_PSI5_RMISET_RMI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI26 */
#define IFX_PSI5_RMISET_RMI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI26 */
#define IFX_PSI5_RMISET_RMI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI26 */
#define IFX_PSI5_RMISET_RMI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI27 */
#define IFX_PSI5_RMISET_RMI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI27 */
#define IFX_PSI5_RMISET_RMI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI27 */
#define IFX_PSI5_RMISET_RMI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI28 */
#define IFX_PSI5_RMISET_RMI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI28 */
#define IFX_PSI5_RMISET_RMI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI28 */
#define IFX_PSI5_RMISET_RMI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI29 */
#define IFX_PSI5_RMISET_RMI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI29 */
#define IFX_PSI5_RMISET_RMI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI29 */
#define IFX_PSI5_RMISET_RMI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI2 */
#define IFX_PSI5_RMISET_RMI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI30 */
#define IFX_PSI5_RMISET_RMI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI30 */
#define IFX_PSI5_RMISET_RMI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI30 */
#define IFX_PSI5_RMISET_RMI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI31 */
#define IFX_PSI5_RMISET_RMI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI31 */
#define IFX_PSI5_RMISET_RMI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RMISET_Bits.RMI31 */
#define IFX_PSI5_RMISET_RMI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RMISET_Bits.RMI3 */
#define IFX_PSI5_RMISET_RMI3_MSK (0x1u)

