Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI17 */
#define IFX_PSI5_TEICLR_TEI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI18 */
#define IFX_PSI5_TEICLR_TEI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI19 */
#define IFX_PSI5_TEICLR_TEI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI1 */
#define IFX_PSI5_TEICLR_TEI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI20 */
#define IFX_PSI5_TEICLR_TEI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI21 */
#define IFX_PSI5_TEICLR_TEI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI22 */
#define IFX_PSI5_TEICLR_TEI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI23 */
#define IFX_PSI5_TEICLR_TEI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI24 */
#define IFX_PSI5_TEICLR_TEI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI25 */
#define IFX_PSI5_TEICLR_TEI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI26 */
#define IFX_PSI5_TEICLR_TEI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI27 */
#define IFX_PSI5_TEICLR_TEI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI2 */
#define IFX_PSI5_TEICLR_TEI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI3 */
#define IFX_PSI5_TEICLR_TEI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI4 */
#define IFX_PSI5_TEICLR_TEI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI5 */
#define IFX_PSI5_TEICLR_TEI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI6 */
#define IFX_PSI5_TEICLR_TEI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI7 */
#define IFX_PSI5_TEICLR_TEI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI8 */
#define IFX_PSI5_TEICLR_TEI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEICLR_Bits.TEI9 */
#define IFX_PSI5_TEICLR_TEI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_TEIOV_Bits.TEI0 */
#define IFX_PSI5_TEIOV_TEI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI0 */
#define IFX_PSI5_TEIOV_TEI0_MSK (0x1u)

