Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI0 */
#define IFX_PSI5_TEISET_TEI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI0 */
#define IFX_PSI5_TEISET_TEI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI0 */
#define IFX_PSI5_TEISET_TEI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI10 */
#define IFX_PSI5_TEISET_TEI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI10 */
#define IFX_PSI5_TEISET_TEI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI10 */
#define IFX_PSI5_TEISET_TEI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI11 */
#define IFX_PSI5_TEISET_TEI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI11 */
#define IFX_PSI5_TEISET_TEI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI11 */
#define IFX_PSI5_TEISET_TEI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI1 */
#define IFX_PSI5_TEISET_TEI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI1 */
#define IFX_PSI5_TEISET_TEI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI1 */
#define IFX_PSI5_TEISET_TEI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_OFF (22u)

